## Pandas Tutorial

### Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Pandas uses something called a dataframe. It is a 
# 2D data structure that can hold multiple data types.
# Columns have labels.

# Series are built on top of NumPy arrays. 
# Create a series by first creating a list
list_1 = ['a', 'b', 'c', 'd']
labels = [1,2,3,4]

# I can define that I want the series indexes to be the provided labels
ser_1 = pd.Series(data = list_1, index = labels)
print(ser_1)

1    a
2    b
3    c
4    d
dtype: object

In [3]:
arr_1 = np.array([1,2,3,4])
ser_2 = pd.Series(arr_1)

dict_1 = {'f_name': "Derek", "l_name": "Banas", "age": 44}
ser_3 = pd.Series(dict_1)
print(ser_3['f_name'])

Derek

In [4]:
# You can get the datatype
print(ser_2.dtype)

int32

In [5]:
# You can perform math operations on series
print(ser_2 + ser_2)
ser_2 - ser_2
ser_2 * ser_2
ser_2 / ser_2

0    2
1    4
2    6
3    8
dtype: int32

0    1.0
1    1.0
2    1.0
3    1.0
dtype: float64

In [6]:
# You can assign names to series
ser_4 = pd.Series({8: 9, 9: 10}, name='rand_nums')
ser_4.name

'rand_nums'

### DataFrames

#### Creating DataFrames

In [7]:
from numpy import random

# Create random matrix 2x3 with values between 10 and 50
arr_2 = np.random.randint(10, 50, size=(2, 3))
print(arr_2)

# Create DF with data, row labels & column labels
df_1 = pd.DataFrame(arr_2, ['A', 'B'], ['C', 'D', 'E'])
print(df_1)

[[28 39 36]
 [24 35 29]]
    C   D   E
A  28  39  36
B  24  35  29

In [8]:
# Create a DF from multiple series in a dict
# If series are of different lengthes extra spaces are NaN
dict_3 = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
         'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df_2 = pd.DataFrame(dict_3)
print(df_2)

# from_dict accepts a column labels and lists
print(pd.DataFrame.from_dict(dict([('A', [1,2,3]), ('B', [4,5,6])])))


# You can assign the keys as row labels and column labels separate
# with orient='index'
print(pd.DataFrame.from_dict(dict([('A', [1,2,3]), ('B', [4,5,6])]),
                      orient='index', columns=['one','two','three']))


# Get number of rows and columns as tuple
print(df_1.shape)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0
   A  B
0  1  4
1  2  5
2  3  6
   one  two  three
A    1    2      3
B    4    5      6
(2, 3)

### Editing and Retreiving Data

In [9]:
# Grab a column
print(df_1['C'])
# Get multiple columns
df_1[['C', 'E']]

# Grabb a row as a series
print(df_1.loc['A'])
# Grab row by index position
print(df_1.iloc[1])

# Grab multiple cells by defining rows wanted & the
# columns from those rows
print(df_1.loc[['A', 'B'], ['D', 'E']])

A    28
B    24
Name: C, dtype: int32
C    28
D    39
E    36
Name: A, dtype: int32
C    24
D    35
E    29
Name: B, dtype: int32
    D   E
A  39  36
B  35  29

In [10]:
# Make new column
df_1['Total'] = df_1['C'] + df_1['D'] + df_1['E']
df_1

# You can perform multiple calculations
df_2['mult'] = df_2['one'] * df_2['two']
df_2

# Make a new row by appending
dict_2 = {'C': 44, 'D': 45, 'E': 46}
new_row = pd.Series(dict_2, name='F')
df_1 = df_1.append(new_row)

# Delete column and set inplace to True which is required
# because Pandas tries to help you not delete data
# by accident
# df_1.drop('Total', axis=1, inplace=True)
# df_1
# # Delete a row
# df_1.drop('B', axis=0, inplace=True)
# df_1

In [12]:
# Create a new column and make it the index
# df_1['Sex'] = ['Men', 'Women']
# df_1.set_index('Sex', inplace=True)
# print(df_1)

In [13]:
# You can reset index values to numbers
#df_1.reset_index(inplace=True)
df_1

# Assign can be used to create a column while leaving the
# original DF untouched
df_2.assign(div=df_2['one'] / df_2['two'])

# You can pass in a function as well
df_2.assign(div=lambda x: (x['one'] / x['two']))

   one  two  mult  div
a  1.0  1.0   1.0  1.0
b  2.0  2.0   4.0  1.0
c  3.0  3.0   9.0  1.0
d  NaN  4.0   NaN  NaN

In [14]:
# Combine DataFrames while keeping df_3 data unless
# there is a NaN value
df_3 = pd.DataFrame({'A': [1., np.nan, 3., np.nan]})
df_4 = pd.DataFrame({'A': [8., 9., 2., 4.]})
df_3.combine_first(df_4)

     A
0  1.0
1  9.0
2  3.0
3  4.0

### Conditional Selection

In [15]:
arr_2 = np.random.randint(10, 50, size=(2, 3))
df_1 = pd.DataFrame(arr_2, ['A', 'B'], ['C', 'D', 'E'])
print(df_1)

# You can use conditional operators to retrieve a table based on the condition
print("Greater than 40\n", df_1 > 40.0)

# You can use comparison operater functions as well like
# gt, lt, ge, le, eq, ne
print("Greater than 45\n", df_1.gt(45.0))

# You can place conditions in brackets as well
bool_1 = df_1 >= 45.0
df_1[bool_1]

# Get bools for a column
df_1['E'] > 40

# Return a row if cell value in column matches a condition
df_1[df_1['E']>30]

    C   D   E
A  20  36  49
B  15  35  46
Greater than 40
        C      D     E
A  False  False  True
B  False  False  True
Greater than 45
        C      D     E
A  False  False  True
B  False  False  True

    C   D   E
A  20  36  49
B  15  35  46

In [16]:
# You can focus on a column based on resulting dataframe
df_2 = df_1[df_1['E']>30]
df_2['C']

A    20
B    15
Name: C, dtype: int32

In [17]:
# You can stack these commands
print(df_1[df_1['E']>20]['C'])
print()

A    20
B    15
Name: C, dtype: int32

In [18]:
# You can use multiple conditions
arr_3 = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df_2 = pd.DataFrame(arr_3, ['A', 'B', 'C'], ['X', 'Y', 'Z'])
print(df_2, "\n")
# You can use or | to combine conditions as well
df_2[(df_2['X']>3) & (df_2['X']<7)]

df_2[(df_2['X']>3) | (df_2['X']<7)]

   X  Y  Z
A  1  2  3
B  4  5  6
C  7  8  9

   X  Y  Z
A  1  2  3
B  4  5  6
C  7  8  9

### File Input/Output

In [19]:
# import pymysql

# Read a CSV file
# Type pd.read_ [TAB] to see the file types you can read
cs_df = pd.read_csv('ComputerSales.csv')

### Basics & Math

In [20]:
# Display 1st 5 rows
cs_df.head()
# Display last 5 rows
cs_df.tail()
# Get 1st 2
cs_df[:2]
# Get 1st through 5 with a 2 step
cs_df[:5:2]

# Get indexes
cs_df.index.array
# Get NumPy array
cs_df.to_numpy()
# Get array from series
ser_1.array

dict_3 = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
         'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df_2 = pd.DataFrame(dict_3)

# You can replace NaN values with 0 or anything else
print(df_2.fillna(0))
# Get values in row 2
row = df_2.iloc[1]
# Add items in row 2 to all rows including row 2
# You can do the same with sub, mul, and div
df_2.add(row, axis='columns')

# Get column 2
col = df_2['two']
# Subtract from other columns
df_2.sub(col, axis=0)

# Check if empty
df_2.empty

# Transform executes a function on a dataframe
df_5 = pd.DataFrame({'A': range(3), 'B': range(1, 4)})
df_5.transform(lambda x: x+1)
df_5.transform(lambda x: x**2)
df_5.transform(lambda x: np.sqrt(x))
# You can transform using multiple functions
df_5.transform([lambda x: x**2, lambda x: x**3])
# Passing a dictionary allows you to perform different calculations
# on different columns
df_5.transform({'A': lambda x: x**2, 'B': lambda x: x**3})

# map performs a function on a series
df_5['A'].map(lambda x: x**2)

# applymap does the same on a dataframe
df_5.applymap(lambda x: x**2)

# Get unique values in column 2 of DF
df_2['two'].unique()

# Get number of uniques
df_2['two'].nunique()

# Get the number of times each value showed in column 2
df_2['two'].value_counts()

# Get column names
df_2.columns

# Get index info
df_2.index

# Return a DF that lists null values as True
df_2.isnull()

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  0.0  4.0

     one    two
a  False  False
b  False  False
c  False  False
d   True  False

### Group Data

In [26]:
# Groupby allows you to group rows based on a columnand perform a function
# that combines those values (Aggregate Function)
dict_5 = {'Store': [1,2,1,2], 'Flavor': ['Choc', 'Van', 'Straw', 'Choc'], 
         'Sales': [26, 12, 18, 22]}

df_11 = pd.DataFrame(dict_5)

# Gruop data by the store number
by_store = df_11.groupby("Store")
#Get the mean sales by store
print(by_store.mean())

# Get sales total just for store 1
print(by_store.sum().loc[1])

# You can use multiple functions of
print(by_store.describe())

       Sales
Store
1       22.0
2       17.0
Sales    44
Name: 1, dtype: int64
      Sales
      count  mean       std   min   25%   50%   75%   max
Store
1       2.0  22.0  5.656854  18.0  20.0  22.0  24.0  26.0
2       2.0  17.0  7.071068  12.0  14.5  17.0  19.5  22.0

### Concatenate Merge and Join Data

In [27]:
# You can concatenate DFs in the order DFs are provided
df_12 = pd.DataFrame({'A': [1,2,3],
                     'B': [4,5,6]},
                    index=[1,2,3])
df_13 = pd.DataFrame({'A': [7,8,9],
                     'B': [10,11,12]},
                    index=[4,5,6])
pd.concat([df_12, df_13])

   A   B
1  1   4
2  2   5
3  3   6
4  7  10
5  8  11
6  9  12

In [30]:
# Merge 2 DFs using their shared key column
df_12 = pd.DataFrame({'A': [1,2,3],
                     'B': [4,5,6],
                     'key': [1,2,3]})
df_13 = pd.DataFrame({'A': [7,8,9],
                     'B': [10,11,12],
                     'key': [1,2,3]})

# inner merges at the intersection of keys
pd.merge(df_12, df_13, how='inner', on='key')

# how='left' or 'right' : Use keys from left or right frame
# how='outer' : Use union of keys
print(pd.merge(df_12, df_13, how='right', on='key'))

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

In [31]:
# You can join DFs with different indexes and instead of using 
# keys use a column
df_12 = pd.DataFrame({'A': [1,2,3],
                     'B': [4,5,6]},
                    index=[1,2,3])
df_13 = pd.DataFrame({'C': [7,8,9],
                     'D': [10,11,12]},
                    index=[1,4,5])
df_12.join(df_13, how='outer')

     A    B    C     D
1  1.0  4.0  7.0  10.0
2  2.0  5.0  NaN   NaN
3  3.0  6.0  NaN   NaN
4  NaN  NaN  8.0  11.0
5  NaN  NaN  9.0  12.0

### Statistics

In [32]:
# Get ice cream sales data
ics_df = pd.read_csv('icecreamsales.csv')
ics_df

    Temperature  Sales
0            37    292
1            40    228
2            49    324
3            61    376
4            72    440
5            79    496
6            83    536
7            81    556
8            75    496
9            64    412
10           53    324
11           40    320

In [35]:
# Get total count of both columns
ics_df.count()

# skipna skips null / NaN values
print(ics_df.sum(skipna=True))

# Get mean for named column
ics_df["Sales"].mean()
ics_df["Sales"].median()
ics_df["Sales"].mode()
ics_df["Sales"].min()
ics_df["Sales"].max()
ics_df["Sales"].prod() # Product of values
ics_df["Sales"].std() # Standard deviation
ics_df["Sales"].var() # Variance
ics_df["Sales"].sem() # Standard error

Temperature     734
Sales          4800
dtype: int64

30.498882244794125

In [36]:
# Negative : Left long tail, Positive : Right long tail
ics_df["Sales"].skew()

0.036552031682046925

In [40]:
# Kurtosis : < 3 less outliers, 3 Normal Distribution,
# > 3 more outliers
ics_df["Sales"].kurt()
ics_df["Sales"].quantile(.5)
ics_df["Sales"].cumsum()
ics_df["Sales"].cumprod()
ics_df["Sales"].cummax()
ics_df["Sales"].cummin()

# Multiple stats at once
ics_df.describe()

       Temperature       Sales
count    12.000000   12.000000
mean     61.166667  400.000000
std      17.055169  105.651227
min      37.000000  228.000000
25%      46.750000  323.000000
50%      62.500000  394.000000
75%      76.000000  496.000000
max      83.000000  556.000000

In [41]:
ser_dice = pd.Series(data=[2, 3, 3, 4, 4, 4, 5, 5, 5, 5, 6, 6, 
                           6, 6, 6, 7, 7, 7, 7, 7, 7, 8, 8, 8,
                          8, 8, 9, 9, 9, 9, 10, 10, 10, 11, 11, 12])
# Count for each value in series
ser_dice.value_counts()

7     6
6     5
8     5
5     4
9     4
4     3
10    3
3     2
11    2
2     1
12    1
dtype: int64

In [42]:
# You can perform calculations on multiple columns using
# aggregate
print(df_2)
df_2.agg(np.mean)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

one    2.0
two    2.5
dtype: float64

In [43]:
# You can do this with multiple functions
df_2.agg(['mean', 'std'])

      one       two
mean  2.0  2.500000
std   1.0  1.290994

### Iteration

In [45]:
# Iterating over series
ser_7 = pd.Series(range(5), index=['a', 'b', 'c', 'd', 'e'])
for col in ser_7:
    print(col)

print()

0
1
2
3
4

In [51]:
# Iterating over DFs
arr_4 = np.random.randint(10, 50, size=(2, 3))
df_8 = pd.DataFrame(arr_4, ['B', 'C'], ['C', 'D', 'E'])
print(df_8)
print()
# items allows you to iterate through key value pairs to make
# calculations 1 column at a time
for label, ser in df_8.items():
    print(label)
    print(ser)   
print()

    C   D   E
B  31  13  11
C  34  42  48

C
B    31
C    34
Name: C, dtype: int32
D
B    13
C    42
Name: D, dtype: int32
E
B    11
C    48
Name: E, dtype: int32

In [52]:
# You can also iterate through rows
for index, row in df_8.iterrows():
    print(f"{index}\n{row}")
print()

B
C    31
D    13
E    11
Name: B, dtype: int32
C
C    34
D    42
E    48
Name: C, dtype: int32

In [53]:
# Get a tuple that contains row data
for row in df_8.itertuples():
    print(row)

Pandas(Index='B', C=31, D=13, E=11)
Pandas(Index='C', C=34, D=42, E=48)

In [55]:
df_8

# Sorting by index will return the same results if indexes
# are in order, to reverse indexes mark ascending as False
df_8.sort_index(ascending=False)

# Sort by value for column D (Use the same function for series)
df_8.sort_values(by='D')

    C   D   E
B  31  13  11
C  34  42  48

### Passing Data to Functions

In [56]:
import sys

# You can pass DataFrames and Series into functions
def get_profit_total(df):
    prof_ser = df['Profit']
    print(f"Total Profit : {prof_ser.sum()}")

get_profit_total(cs_df)

Total Profit : 5459.010000000001

In [60]:
# Receives a DataFrame, splits the contact into new columns
# being first and last name
def split_name(df):
    def get_names(full_name):
        # Split contact at space
        f_name, l_name = full_name.split()
        # Create a series with first & last names in columns
        # with those labels
        return pd.Series(
        (f_name, l_name),
        index=['First Name', 'Last Name']
        )
    # apply() executes the function on all names in Contact column
    names = df['Contact'].apply(get_names)
    df[names.columns] = names
    return df

# Run function and display top 5 results
split_name(cs_df).head()

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year,First Name,Last Name
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018,Paul,Thomas
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018,Margo,Simms
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018,Sam,Stine
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018,Moe,Eggert
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018,Jessica,Elk

In [62]:
def create_age_groups(df):
    # Must have 1 more bins than labels
    bins = [0, 30, 50, sys.maxsize]
    # Group labels
    labels = ['<30', '30-50', '>50']
    age_group = pd.cut(df['Age'], bins = bins, labels = labels)
    df['Age_Group'] = age_group
    return df

create_age_groups(cs_df)

# You can use a pipe to pass a dataframe to multiple functions
cs_df.pipe(split_name).pipe(create_age_groups).head()

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year,First Name,Last Name,Age_Group
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018,Paul,Thomas,30-50
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018,Margo,Simms,30-50
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018,Sam,Stine,<30
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018,Moe,Eggert,30-50
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018,Jessica,Elk,>50

### Aligning, Reindexing and Renaming Labels

In [68]:
ser_6 = pd.Series(range(5), index=['a', 'b', 'c', 'd', 'e'])
sl_1 = ser_6[:4]
sl_2 = ser_6[1:]
print(sl_1)
print(sl_2)
print()
# Align both series by the union of their indexes
sl_1.align(sl_2)

# Align by calling series
sl_1.align(sl_2, join='left')
print()
# Use passed series indexes
sl_1.align(sl_2, join='right')

# Get where indexes intersect
sl_1.align(sl_2, join='inner')

a    0
b    1
c    2
d    3
dtype: int64
b    1
c    2
d    3
e    4
dtype: int64

(b    1
 c    2
 d    3
 dtype: int64,
 b    1
 c    2
 d    3
 dtype: int64)

In [69]:
# You can use align with DFs as well
arr_3 = np.random.randint(10, 50, size=(2, 3))
df_6 = pd.DataFrame(arr_3, ['A', 'B'], ['C', 'D', 'E'])
arr_3 = np.random.randint(10, 50, size=(2, 3))
df_7 = pd.DataFrame(arr_3, ['B', 'C'], ['C', 'D', 'E'])
df_6
df_6.align(df_7)

(      C     D     E
 A  46.0  37.0  28.0
 B  11.0  35.0  48.0
 C   NaN   NaN   NaN,
       C     D     E
 A   NaN   NaN   NaN
 B  21.0  23.0  48.0
 C  28.0  27.0  41.0)

In [70]:
# reindex allows you to align data by index
ser_6.reindex(['c','b','a'])

# Do the same with DFs
df_6.reindex(['B','A'])

# Drop is very similar to reindex except it receives labels
# you don't want to include
df_6.drop(['A'], axis=0)
df_6.drop(['D'], axis=1)

# You can rename labels
df_6.rename(columns={'C': 'Men', 'D': 'Women', 'E': 'Pets'},
           index={'A': 1, 'B': 2})

   Men  Women  Pets
1   46     37    28
2   11     35    48